import os
import sys

"""
기말 평가 15 - 1
- 홀수/짝수 나누기
- 개수를 입력 받은 후 해당 개수만큼 숫자 입력
- 입력한 숫자가 홀수 일 경우 왼쪽부터 채우고 짝수 일 경우 오른쪽부터 채운다

Ex)
개수 입력 : 6
1 번째 숫자 입력 : 1
2 번째 숫자 입력 : 2
3 번째 숫자 입력 : 3
4 번째 숫자 입력 : 4
5 번째 숫자 입력 : 5
6 번째 숫자 입력 : 6

=====> 결과 <=====
1, 3, 5, 6, 4, 2


기말 평가 15 - 2
- 피보나치 수열 출력하기
- 개수를 입력 받은 후 해당 개수만큼 피보나치 수열 출력

Ex)
개수 입력 : 8
1, 1, 2, 3, 5, 8, 13, 21


기말 평가 15 - 3
- 야구 게임 제작하기
- 1 ~ 9 범위의 숫자 중 중복되지 않는 4 개 숫자 (정답) 생성
- 4 개의 숫자를 입력 받은 후 Strike 및 Ball 여부 판정
- 입력 한 숫자가 정답에 포함 되어있고 위치가 같으면 Strike
- 입력 한 숫자가 정답에 포함 되어있지만 위치가 다르다면 Ball
- 4 Strike 를 달성하면 게임 종료

Ex)
정답 : 1, 3, 5, 8

숫자 (4 개) 입력 : 3 1 6 5
결과 : 0 Strike, 3 Ball

숫자 (4 개) 입력 : 1 3 5 8
결과 : 4 Strike, 0 Ball

게임을 종료합니다.
"""


# Practice 15
def Practice_15(args):
	pass
